results/cpu-vs-latency5/memcached/12-1/nsl206.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     3436094 ops,  115205 (avg:  114533) ops/sec, 4.35MB/sec (avg: 4.32MB/sec),  1.65 (avg:  1.67) msec latency

12        Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets       10414.84          ---          ---      1.85100       772.00
Gets      104116.19     11824.44     92291.75      1.65500      3650.89
Totals    114531.03     11824.44     92291.75      1.67300      4422.89


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     84.18742
SET       2.000     89.06740
SET       3.000     99.25206
SET       4.000     99.35928
SET       5.000     99.36568
SET       6.000     99.44025
SET       7.000     99.99104
SET       8.000     99.99264
SET       9.000     99.99328
SET      10.000     99.99424
SET      11.000     99.99520
SET      12.000     99.99552
SET      15.000     99.99616
SET      16.000     99.99680
SET      18.000     99.99712
SET      19.000     99.99744
SET      20.000     99.99808
SET      21.000     99.99840
SET      22.000     99.99872
SET      62.000     99.99904
SET      77.000     99.99936
SET    30000.000    100.00000
---
GET       0.400      0.00003
GET       0.410      0.00016
GET       0.420      0.00022
GET       0.430      0.00032
GET       0.440      0.00042
GET       0.450      0.00058
GET       0.460      0.00064
GET       0.470      0.00077
GET       0.480      0.00099
GET       0.490      0.00118
GET       0.500      0.00150
GET       0.510      0.00170
GET       0.520      0.00179
GET       0.530      0.00208
GET       0.540      0.00224
GET       0.550      0.00259
GET       0.560      0.00285
GET       0.570      0.00317
GET       0.580      0.00349
GET       0.590      0.00416
GET       0.600      0.00467
GET       0.610      0.00512
GET       0.620      0.00560
GET       0.630      0.00643
GET       0.640      0.00720
GET       0.650      0.00804
GET       0.660      0.00903
GET       0.670      0.01085
GET       0.680      0.01229
GET       0.690      0.01431
GET       0.700      0.01620
GET       0.710      0.01825
GET       0.720      0.02103
GET       0.730      0.02411
GET       0.740      0.02785
GET       0.750      0.03125
GET       0.760      0.03550
GET       0.770      0.04053
GET       0.780      0.04610
GET       0.790      0.05321
GET       0.800      0.06278
GET       0.810      0.07306
GET       0.820      0.08343
GET       0.830      0.09697
GET       0.840      0.11346
GET       0.850      0.13247
GET       0.860      0.15418
GET       0.870      0.17726
GET       0.880      0.20393
GET       0.890      0.23028
GET       0.900      0.25983
GET       0.910      0.28886
GET       0.920      0.32024
GET       0.930      0.35430
GET       0.940      0.38891
GET       0.950      0.42774
GET       0.960      0.47029
GET       0.970      0.51984
GET       0.980      0.57888
GET       0.990      0.64556
GET       1.000      1.41438
GET       1.100     19.13761
GET       1.200     58.74878
GET       1.300     62.56005
GET       1.400     63.35685
GET       1.500     63.59234
GET       1.600     63.88732
GET       1.700     65.91681
GET       1.800     77.18257
GET       1.900     83.71458
GET       2.000     84.61612
GET       2.100     84.86510
GET       2.200     85.24091
GET       2.300     87.01717
GET       2.400     88.68254
GET       2.500     88.98559
GET       2.600     89.05205
GET       2.700     89.08112
GET       2.800     89.09706
GET       2.900     89.10653
GET       3.000     89.11412
GET       3.100     89.12549
GET       3.200     89.14636
GET       3.300     89.21708
GET       3.400     89.56878
GET       3.500     91.18802
GET       3.600     94.46673
GET       3.700     97.21536
GET       3.800     98.65106
GET       3.900     99.18576
GET       4.000     99.32566
GET       4.100     99.36398
GET       4.200     99.37778
GET       4.300     99.38379
GET       4.400     99.38674
GET       4.500     99.38844
GET       4.600     99.38937
GET       4.700     99.38965
GET       4.800     99.38988
GET       4.900     99.39116
GET       5.000     99.39266
GET       5.100     99.39378
GET       5.200     99.39414
GET       5.300     99.39471
GET       5.400     99.39545
GET       5.500     99.39628
GET       5.600     99.39676
GET       5.700     99.39708
GET       5.800     99.39727
GET       6.000     99.39746
GET       6.100     99.39778
GET       6.200     99.39823
GET       6.300     99.39852
GET       6.400     99.39871
GET       6.500     99.39935
GET       6.600     99.40060
GET       6.700     99.40384
GET       6.800     99.41168
GET       6.900     99.43643
GET       7.000     99.49492
GET       7.100     99.59915
GET       7.200     99.71757
GET       7.300     99.82645
GET       7.400     99.91251
GET       7.500     99.96238
GET       7.600     99.98777
GET       7.700     99.99609
GET       7.800     99.99872
GET       7.900     99.99926
GET       8.000     99.99942
GET       8.100     99.99952
GET       8.200     99.99962
GET       9.000     99.99978
GET       9.100     99.99984
GET       9.200     99.99990
GET       9.400     99.99997
GET       9.500    100.00000